# Μια γέφυρα παλαιάς κατασκευής εξυπηρετεί την διέλευση των αυτοκινήτων των κατοίκων
# της περιοχής μεταξύ των δύο άκρων της (L) και (R). Η διέλευση ενός οχήματος από την
# γέφυρα είναι δυνατή και προς τις δύο δυνατές κατευθύνσεις. Συγκεκριμένα, ένα όχημα
# μπορεί να διασχίσει την γέφυρα με κατεύθυνση προς τα δεξιά (Right Direction) κινούμενο
# από το άκρο (L) προς το άκρο (R), καθώς και με κατεύθυνση προς τα αριστερά (Left Direction)
# κινούμενο από το άκρο (R) προς το άκρο (L). Λόγω της παλαιότητας της γέφυρας δεν είναι
# δυνατή η ταυτόχρονη διάσχισή της και προς τις δύο κατευθύνσεις. Επιπλέον, δεν
# επιτρέπεται η ταυτόχρονη διάσχιση της γέφυρας (πάντα προς την ίδια κατεύθυνση) σε 
# περισσότερα από τρία οχήματα. Να μοντελοποιήσετε το παραπάνω πρόβλημα στο
# προγραμματιστικό περιβάλλον της Python αποφεύγοντας την ανάδυση συνθηκών
# λιμοκτονίας μεταξύ των διεργασιών που προσομοιώνουν την διέλευση των οχημάτων από
# την γέφυρα. 

#προσομοίωση νήματος
from threading import Lock, Thread
#για να μας δίνει μηνύματα για κάθε διεργασία
import logging
#καταστασεις απενεργοποίσης διεργασιών
import time
#Generate pseudo-random numbers
import random

class Bridge:
    def __init__(self):
        #Initialize a list for threads